{
  "noticias_home": [
    {
      "img": "/code.jpeg",
      "date": "29 Fev. 2024",
      "title": "Lista dos aprovados - Residência de Software (2024/1)",
      "description": "Confira os alunos aprovados para ingressar na Residência de Software (2024/1)"
    },
    {
      "img": "/vr.jpeg",
      "date": "19 Fev. 2024",
      "title": "Edital - Residência de Software 2024/1",
      "description": "Este Edital apresenta e divulga a 5ª edição do Programa de Residência de Software (PRSw - FCI/MackLeaps)."
    }
  ],
  "pesquisa_home": [
    {
      "img": "/code.jpeg",
      "txt": "Proposta de um modelo de PSP adaptado a Autodireção em Fases aplicado para o desenvolvimento de maturidade em alunos iniciantes em Computação",
      "url": ""
    },
    {
      "img": "/psp.jpeg",
      "txt": "Modelo de arquitetura de software da plataforma de índice de sustentabilidade Mackenzie-FIESP.",
      "url": ""
    }
  ],
  "projetos": [
    {
      "id": "1",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Estação Meteorológica",
      "body": "O sistema consiste em uma aplicação que se comunica a uma estação meteorológica e seus sensores, coletando e manipulando dados climáticos em tempo real. O sistema armazena os dados coletados em um banco de dados, oferecendo funções como filtrar e descargar os dados brutos para fim de análise. Também compõe a aplicação uma API (Application Programming Interface) que fornece dados atualizados em tempo real para uso em sistemas computacionais externos. A interface gráfica se dará através de uma página web responsiva, com a apresentação de dashboards e gráficos de análise dos dados. Os usuários do sistema deverão acessar informações climáticas do momento (temperatura, probabilidade de chuva, umidade) a partir de um dashboard em uma página web. Além disso, deve ser possível realizar download dos dados armazenados de todos os sensores da estação. O sistema deve ainda oferecer a possibilidade de filtrar a visualização e download dos dados considerando como parâmetro período, tipo de dado e extensão de arquivo que o usuário deseja. Também será possível visualizar gráficos interativos de forma simples e resumida dos históricos de chuva, umidade, velocidade do vento, temperatura. Os dados da estação meteorológica devem ser buscados e carregados no banco de dados a cada 15 minutos. Por fim, o sistema deve contar com uma área de alertas visível na página inicial informando o usuário sobre situações de risco como: temperaturas elevadas, vento forte e baixa umidade do ar. Os alertas também devem ser feitos via notificação push.",
      "description": "Aplicação que se comunica a uma estação meteorológica e seus sensores, coletando e manipulando dados climáticos em tempo real."
    },
    {
      "id": "2",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Site Mackleaps",
      "body": "O website do MackLeaps tem como escopo divulgar pesquisas e projetos relacionados à tecnologia, em andamento e concluídos, assim como recrutar potenciais membros e parceiros, como estudantes, empresas, instituições acadêmicas e pesquisadores com propósito similar. Para tanto, é necessário que esse sistema seja constantemente alimentado com dados atualizados, selecionados pelos administradores. Outrossim, é necessário que, além de conhecer os trabalhos realizados, os interessados também possam ter uma visão geral do laboratório, bem como conhecer a equipe e entrar em contato com o laboratório, seja para sanar dúvidas, seja para agendar visitas ou reuniões. Em seu estado atual, o website apresenta alguns problemas técnicos e de design, que dificultam ou desincentivam seu uso, como, por exemplo: a ausência de um menu principal com atalhos para todas as seções do website, agilizando a navegação; ícones estáticos e desinteressantes; textos genéricos, pouco informativos, em especial no tocante aos projetos e às pesquisas, que seriam o principal tópico do website e demandam uma seção específica e mais aprofundada; imagens pouco profissionais ou não muito relacionadas à área de tecnologia; inexistência de documentação; arquitetura totalmente centralizada, além de outros problemas a serem aprofundados mais adiante deste relatório e no decorrer do programa de Residência. Assim, tendo em vista a necessidade de se destacar entre os demais laboratórios de pesquisa na área de tecnologia, bem como evidenciar o comprometimento dos membros do laboratório, o presente projeto busca tornar o website do MackLeaps mais atraente, interessante, dinâmico, moderno, fácil de navegar (em qualquer plataforma), intuitivo e rápido, assim como facilitar a sua frequente atualização.",
      "description": "Tem como escopo divulgar pesquisas e projetos relacionados à tecnologia e recrutar potenciais membros e parceiros."
    },
    {
      "id": "3",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Contador de gente",
      "body": "Este projeto visa desenvolver e implementar o sistema Contador de Gente para monitoramento de pessoas no campus universitário Higienópolis da Mackenzie. O sistema coletará dados da circulação de pessoas, os armazenará em uma base de dados em nuvem e disponibilizará relatórios personalizados através de uma aplicação web, transformando dados em informações úteis e com possibilidades de personalização. O objetivo é fornecer informações em tempo real para auxiliar professores, coordenadores, equipes de segurança e outros membros do corpo administrativo da universidade na tomada de decisões relacionadas à segurança, organização e gestão do campus. Através do servidor local, onde serão centralizados os vídeos capturados pelas ESP-32-CAMs, o sistema deve ser capaz de processar as imagens (vídeos) por meio do OpenCV para gerar informações. Além disso, será composto pelos seguintes servidores: Servidor de captura de imagens, Servidor de processamento de imagens, Servidor de banco de dados e Servidor de aplicação web, o tipo de servidor poderá ser local (Windows Server, Ubuntu Server, CentOS, ou Nuvem). A aplicação web e o dashboard são componentes cruciais para apresentar as informações coletadas de forma acessível e útil. Esses requisitos detalham as funcionalidades necessárias para a interface web. Com relação ao desempenho, o sistema deve fornecer uma resposta em tempo real ao acessar o dashboard ou gerar relatórios, com um tempo de resposta máximo de 2 segundos para qualquer ação do usuário. Por fim, o sistema deve ser configurado para realizar backups regulares dos dados armazenados em caso de falhas ou perda de dados.",
      "description": "Tem como objetivo a contagem do número de pessoas que entram nos prédios do campus universitário Higienópolis da Mackenzie."
    },
    {
      "id": "4",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Oriente 2.0",
      "body": "O oriente é um sistema de submissão/acompanhamento de TCC em que os professores são capazes de acompanhar o TCC de seus alunos e avaliar projetos de outros orientadores quando sua avaliação for solicitada. Em uma visão geral, o oriente permite uma melhor visualização para professores e alunos sobre seus TCCs. O sistema contará com os seguintes usuários: professor coordenador, professor orientador, professor avaliador, professor suplente e aluno. O professor coordenador é capaz de deletar projetos, resetar senhas, remover pessoas e ativar o evento de sessão de poster. O professor orientador é capaz de aceitar projetos submetidos pelos alunos, agendar avaliação e tem acesso ao projeto e seus orientados. O professor avaliador aceita quando for solicitado como avaliador de um projeto, visualiza os projetos que vai avaliar e submete notas para os projetos avaliados. O professor suplente aceita quando for solicitado como suplente de um projeto, visualiza os projetos que vai avaliar e submete notas para os projetos avaliados (a avaliação do suplente só é requisitada se um avaliador não submeter sua nota). Por fim, os alunos  visualizam seus projetos e aceitam caso sua participação em um projeto seja solicitada.",
      "description": "É um sistema de submissão/acompanhamento de TCC que permite melhor visualização para professores e alunos sobre seus projetos."
    },
    {
      "id": "5",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "AR-TWO",
      "body": "Aplicativo para identificação de transtornos no pulmão, através de um mecanismo de sopro que fornece, além de diagnósticos, tratamentos.",
      "description": "Aplicativo para identificação de transtornos no pulmão, através de um mecanismo de sopro que fornece, além de diagnósticos, tratamentos."
    },
    {
      "id": "6",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "IDT",
      "body": "Modelo de processo para triagem de alunos com sinais de Transtorno do Espectro do Autismo e de Deficiência Intelectual.",
      "description": "Modelo de processo para triagem de alunos com sinais de Transtorno do Espectro do Autismo e de Deficiência Intelectual."
    },
    {
      "id": "7",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "ISMF",
      "body": "Sistema de Criação do Índice de Sustentabilidade da Universidade Presbiteriana Mackenzie.",
      "description": "Sistema de Criação do Índice de Sustentabilidade da Universidade Presbiteriana Mackenzie."
    },
    {
      "id": "8",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "Tagarela",
      "body": "Ferramenta de validação digital para a identificação precoce de déficits de linguagem em crianças.",
      "description": "Ferramenta de validação digital para a identificação precoce de déficits de linguagem em crianças."
    },
    {
      "id": "9",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "Plataforma de força",
      "body": "Avaliação do equilíbrio postural de seres humanos por meio de uma plataforma de força.",
      "description": "Avaliação do equilíbrio postural de seres humanos por meio de uma plataforma de força."
    },
    {
      "id": "10",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "Mackenzie voluntário",
      "body": "Plataforma Web para o Mackenzie Voluntário que visa o cadastro de projetos e dos participantes de ações sociais.",
      "description": "Plataforma Web para o Mackenzie Voluntário que visa o cadastro de projetos e dos participantes de ações sociais."
    },
    {
      "id": "11",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "Latin Project",
      "body": "Plataforma para disponibilização gratuita de livros eletrônicos feitos por professores e autores locais na América Latina.",
      "description": "Plataforma para disponibilização gratuita de livros eletrônicos feitos por professores e autores locais na América Latina."
    },
    {
      "id": "12",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Concluído",
      "title": "Computador de bordo",
      "body": "Aplicação para o Controle do Carro Elétrico, protótipo ultraeficiente movido a energia elétrica desenvolvido pela Escola de Engenharia do Mackenzie.",
      "description": "Aplicação para o Controle do Carro Elétrico, protótipo ultraeficiente movido a energia elétrica desenvolvido pela Escola de Engenharia do Mackenzie."
    },
    {
      "id": "13",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Atlas",
      "body": "O Atlas das Américas é uma iniciativa digital que visa oferecer um recurso centralizado e confiável para informações relacionadas a leis e regulamentações fronteiriças em todo o continente americano. Este site é especialmente projetado para atender às necessidades de profissionais que trabalham em serviços de fronteira, fornecendo acesso fácil a dados atualizados e relevantes para a gestão de fronteiras e processos de imigração.",
      "description": "O Atlas das Américas é uma iniciativa digital que visa oferecer um recurso centralizado e confiável para informações relacionadas a leis e regulamentações fronteiriças em todo o continente americano. "
    },
    {
      "id": "14",
      "img": "/code.jpeg",
      "date": "10 Jan. 2023",
      "status": "Em Andamento",
      "title": "Painel - Carro elétrico",
      "body": "O carro elétrico é um projeto da UPM que conta com alunos de diversos cursos da escola de Engenharia. Consiste na fabricação de um carro que permita alcançar a eficiência energética, utilizando-se de técnicas e conhecimentos das áreas da mecânica, elétrica, eletrônica, programação, entre outras. O objetivo é a participação na Shell Eco-marathon, que é um programa acadêmico global focado em eficiência energética e uma das principais competições de estudantes de engenharia do mundo. Além da estrutura mecânica e elétrica, o carro usa sensores que permitem o monitoramento do consumo de corrente e tensão, temperatura e velocidade do carro. Estes dados são disponibilizados em um painel; uma aplicação desenvolvida para um smartphone que é fixado no volante do carro para que o piloto possa acompanhar o desempenho do veículo de acordo com suas ações. Toda comunicação entre o Arduino e a aplicação é feita via cabo USB, em protocolo serial UART (Universal Asynchronous Receiver-Transmitter). Os dados dos sensores após tratamento são empacotados em uma string em formato JSON, e enviadas para aplicação que recebe esta string e mostra os valores.",
      "description": "Consiste na fabricação de um carro que permita alcançar a eficiência energética, utilizando-se de técnicas e conhecimentos das áreas da mecânica, elétrica, eletrônica, programação, entre outras."
    }
  ],
  "projetos_home": [
    {
      "img": "/cloud.jpeg",
      "status": "Em Andamento",
      "title": "Estação Meteorológica",
      "description": "Aplicação que se comunica a uma estação meteorológica e seus sensores, coletando e manipulando dados climáticos em tempo real."
    },
    {
      "img": "/minimalist_setup.jpeg",
      "status": "Em Andamento",
      "title": "Site Mackleaps",
      "description": "Tem como escopo divulgar pesquisas e projetos relacionados à tecnologia e recrutar potenciais membros e parceiros."
    },
    {
      "img": "/camera.jpeg",
      "status": "Em Andamento",
      "title": "Contador de gente",
      "description": "Tem como objetivo a contagem do número de pessoas que entram nos prédios do campus universitário Higienópolis da Mackenzie."
    },
    {
      "img": "/minimalist_setup.jpeg",
      "status": "Em Andamento",
      "title": "Atlas",
      "description": "O Atlas das Américas é uma iniciativa digital que visa oferecer um recurso centralizado e confiável para informações relacionadas a leis e regulamentações fronteiriças em todo o continente americano."
    }
  ],
  "noticias": [
    {
      "id": "1",
      "img": "/code.jpeg",
      "date": "29 Fev. 2024",
      "author": "Administrador",
      "author_img": "/author.jpeg",
      "title": "Lista dos aprovados - Residência de Software (2024/1)",
      "description": "Confira os alunos aprovados para ingressar na Residência de Software (2024/1)",
      "body": {
        "__html": "<a href='https://drive.google.com/file/d/125qd-rUlw5Xp7DIkhErfCFHXTdan_d67/view?usp=sharing' target='_blank'>Confira a lista dos aprovados</a><br><br><p>A segunda etapa (e etapa final) do processo seletivo da Residência de Software 2024/1  ocorreu no dia 28 de fevereiro de 2024. Esta notícia visa apresentar a lista dos alunos aprovados. Atentem-se às informações abaixo que apresentam orientações sobre o primeiro dia de vocês na Residência:</p><br><p><b>Sejam bem-vindos ao laboratório MackLeaps!</b></p><br><p>O <b>início das atividades</b> na Residência de Software ocorrerá no dia <b>04 de março (Segunda-feira) das 14h às 15h30</b>.</p><br><p>Aos <b>aprovados dos cursos presenciais</b>, aguardamos a sua presença no <b>prédio 6 - sala 203</b>.<br><br>Aos <b>aprovados dos cursos EAD</b>, a reunião será <b>via Teams</b> e todos foram inseridos nesse evento, basta <b>acessar o link no dia/horário informados acima</b>.</p><br><p>Qualquer dúvida, entrar em contato com <b>ivan.oliveira@mackenzie.br</b>.<br><br></p><p>Equipe de Professores MackLeaps – Residência de Software</p><p>Coordenação: prof. Dr. Fábio Silva Lopes e profa. Dra. Maria Amélia Eliseo. </p>"
      }
    },
    {
      "id": "2",
      "img": "/code.jpeg",
      "date": "19 Fev. 2024",
      "author": "Administrador",
      "author_img": "/author.jpeg",
      "title": "Processo seletivo - Residência de Software (2024/1)",
      "description": "Inscrições encerradas!",
      "body": {
        "__html": "<p>O Programa de Residência de Software PRSw - FCI/MackLeaps tem por objetivo fomentar a capacitação profissional em Engenharia de Software e Interação Humano-Computador para atuação nas atividades de projeto, considerando os fatores humanos, implementação e testes em projetos de aplicações computacionais.</p><p>A Residência de Software é um processo que ocorre em uma abordagem prática, por meio de ambientes de imersão, pesquisa e colaboração, orientado por professores, em projetos reais, empresariais ou extensionistas, para promover maturidade nas práticas profissionais que o mercado demanda.</p><p>O PRSw-FCI/MackLeaps consiste na participação em um Roadmap de cinco módulos com foco na implementação de um projeto real de formatura que inclui: aulas teóricas e práticas de laboratório em equipe; construção de artefatos de software, relacionados ao projeto real em desenvolvimento; estudo de ferramentas tecnológicas de comunicação, colaboração e construção de artefatos; estudo e elaboração de Recursos Educacionais Digitais para o aprendizado de elementos integrantes dos módulos do Programa; avaliação do processo e da aprendizagem do trabalhado em cada módulo; dentre outros.</p><p>Além de participar de projetos reais, essa também é uma ótima oportunidade de obter horas de atividades complementares ou de extensão. Fique atento(a)!</p><p>Esta notícia visa comunicar a abertura do processo seletivo de 2024/1 para aqueles que se interessaram pelo projeto. Os(As) alunos(as) selecionados(as) nesta 1a etapa serão comunicados(as) por e-mail e convocados(as) para participar da 2a etapa que ocorrerá entre os dias 27 e 29 de fevereiro. Provavelmente, 28 de fevereiro das 14h às 17h (presencial/virtual). Marque na sua agenda! </p><p>O resultado dos(as) alunos(as) selecionados(as) será divulgado no site do MackLeaps (https://mackleaps.mackenzie.br/) no final do dia 01 de março. O início previsto das atividades será em 04 de março (segunda-feira) das 14h às 16h. Ficaremos felizes em receber novos residentes!</p><a href='https://forms.office.com/r/KZewd7xbpz' target='_blank'>Inscreva-se</a>"
      }
    },
    {
      "id": "3",
      "img": "/code.jpeg",
      "date": "19 Fev. 2024",
      "author": "Administrador",
      "author_img": "/author.jpeg",
      "title": "Edital - Residência de Software 2024/1",
      "description": "Este Edital apresenta e divulga a 5ª edição do Programa de Residência de Software (PRSw - FCI/MackLeaps).",
      "body": {
        "__html": "<p>Este Edital apresenta e divulga a 5ª edição do Programa de Residência de Software (PRSw - FCI/MackLeaps) detalhando: aspectos inerentes a ele, etapas do processo seletivo, quantidade de vagas e outros.</p><p>O Laboratório de Estudos de Ambientes de Produção de Software – MackLeaps/FCI/UPM criou em 2021 uma Residência de Software, com o objetivo de ampliar o potencial de aprendizado em Engenharia de Software e Interação Humano-Computador por meio de práticas conhecidas no mercado com PBL (Problem Based Learning) e CBL (Challenge Based Learning).</p><p>Tais práticas de ensino já conhecidas e adotadas em áreas como Saúde e Computação apresentam potencial para gerar engajamento de estudantes no desenvolvimento de habilidades denominadas Soft Skills, como Liderança, Empatia, Trabalho em Equipe, Engajamento, entre outros, e Hard Skills da Engenharia de Software como Métodos Ágeis, Desenvolvimento de Sistemas e Interação Humano-Computador, propiciando resultados melhores no processo do ensino e da aprendizagem nas áreas envolvidas.</p><p>O Programa de Residência de Software PRSw - FCI/MackLeaps tem por objetivo fomentar a capacitação profissional em Engenharia de Software e Interação Humano-Computador para atuação nas atividades de projeto, considerando os fatores humanos, implementação e testes em projetos de aplicações computacionais.</p><p>A Residência de Software é um processo que ocorre em uma abordagem prática, por meio de ambientes de imersão, pesquisa e colaboração, orientado por professores, em projetos reais, empresariais ou extensionistas, para promover maturidade nas práticas profissionais que o mercado demanda.</p><p>Os alunos ingressantes na 4ª edição (2º semestre de 2023) tiveram a oportunidade de participar ativamente nas etapas DEV e DevOps (incluindo a realização de testes, T&D), ilustradas na Figura 1, envolvendo os projetos: Contador de gente, Estação Meteorológica, Sistema de Avaliação do Oriente e Website do MackLeaps. Os ingressantes nessa 5ª edição (1º semestre de 2024), terão a oportunidade de participar de novos projetos de empresas e instituições captados pelo MackLeaps e realizar a especificação de requisitos desses projetos, a etapa UXD (Figura 1), chegando até a implementação do seu front-end. O envolvimento dos alunos nesses projetos gera grande chance de estágios e trabalhos nesses locais.</p><p>O número de vagas desta edição está limitado a 15. A comissão de professores do Programa realizará a seleção dos candidatos por meio de entrevistas/dinâmicas ou outras atividades julgadas pertinentes, tendo como critérios: Interesse, motivação, disponibilidade, habilidade de comunicação oral e escrita, capacidade de colaboração e trabalho em equipe e algum conhecimento técnico.</p><p><a href='https://drive.google.com/file/d/1NGraA2V6GycaomLfm63mVuwazB8KtQY2/view?usp=drive_link' target='_blank'>Edital completo</a></p>"
      }
    },
    {
      "id": "4",
      "img": "/code.jpeg",
      "date": "15 Fev. 2024",
      "author": "Administrador",
      "author_img": "/author.jpeg",
      "title": "Inscrições para iniciação científica e tecnológica.",
      "description": "Mais informações em breve!",
      "body": { "__html": "<p></p>" }
    }
  ],
  "responsaveis": [
    {
      "img": "/members/anaclaudiarossi.jpg",
      "name": "Ana Claudia Rossi",
      "role": "Responsável pelo laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4797577Y2"
    },
    {
      "img": "/formerMembers/BrunoDaSilva.jpg",
      "name": "Bruno da Silva",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4731498P8"
    },
    {
      "img": "/members/CalebeDePaula.jpg",
      "name": "Calebe de Paula",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4768567D3"
    },
    {
      "img": "/members/DanielaCunha.jpg",
      "name": "Daniela Vieira Cunha",
      "role": "Responsável pelo laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4736051D6"
    },
    {
      "img": "/members/dirceu.jpg",
      "name": "Dirceu Matheus Junior",
      "role": "Coordenador de Pós-Graduação",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4250787A4"
    },
    {
      "img": "/members/elisangela.jpg",
      "name": "Elisângela Botelho Gracias",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4770454P6"
    },
    {
      "img": "/members/fabio.jpg",
      "name": "Fábio Lopes",
      "role": "Responsável pelo laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4184023J5"
    },
    {
      "img": "/members/ivan.jpg",
      "name": "Ivan Carlos Alcantara de Oliveira",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4727078U7"
    },
    {
      "img": "/members/kassya.jpg",
      "name": "Kassya Christina Rigolon de Andrade",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4776993J0"
    },
    {
      "img": "/members/leandro.jpg",
      "name": "Leandro Carlos Fernandes",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4705091D5"
    },
    {
      "img": "/members/LuizLozano.png",
      "name": "Luiz Carlos Machi Lozano",
      "role": "Auxilia o laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K8162703U3"
    },
    {
      "img": "/members/maria.jpg",
      "name": "Maria Amelia",
      "role": "Responsável pelo laboratório Mackleaps",
      "link": "http://buscatextual.cnpq.br/buscatextual/visualizacv.do?metodo=apresentar&id=K4751551Z4"
    }
  ],
  "colaboradores": [
    {
      "img": "https://media.licdn.com/dms/image/D4D03AQHR9zRoqAs5ag/profile-displayphoto-shrink_800_800/0/1683133174208?e=1709769600&v=beta&t=UauI5yB-qrnLDfoOVGoK8-6qib2xAP9i0RUyZTWDGWQ",
      "name": "Álvaro Hibide Claver",
      "role": "Estagiário"
    },
    {
      "img": "https://avatars.githubusercontent.com/u/16262291?v=4",
      "name": "Elieder Damasceno Sousa",
      "role": "Laboratorista"
    },
    {
      "img": "https://media.licdn.com/dms/image/D4D03AQHWKPF7QcWcWQ/profile-displayphoto-shrink_800_800/0/1695410478314?e=1709769600&v=beta&t=p4Q0B4UhKv7gp0jntk1Tc-9UYoY-jYFLWCAFoCNAw7g",
      "name": "Erika Borges Piaui",
      "role": "Estagiário"
    },
    {
      "img": "https://media.licdn.com/dms/image/D4D03AQFC3s8Jds3SzQ/profile-displayphoto-shrink_800_800/0/1672375336635?e=1709769600&v=beta&t=HKkseVG2F2ngOq6_9ed7Opoo10hiN-f06D_zu2fkfOs",
      "name": "Gustavo Garabetti Munhoz",
      "role": "Estagiário"
    },
    {
      "img": "/members/joao.jpeg",
      "name": "João Ricardo de Lima Bonifácio",
      "role": "Laboratorista"
    }
  ],
  "excolaboradores": [
    {
      "img": "https://media.licdn.com/dms/image/C4E03AQG0m-pnxryIXw/profile-displayphoto-shrink_800_800/0/1657127675166?e=1709769600&v=beta&t=ywjIVRCTMccbOBYC9GE26BgLOl7YFk63kDwUaqNqqZs",
      "name": "Alan Ricardo",
      "date": "2019 a 2020"
    },
    {
      "img": "/formerMembers/andre.jpeg",
      "name": "André Philipe Andriotti de Moraes",
      "date": "2022 a 2023"
    },
    {
      "img": "/formerMembers/beatriz.jpg",
      "name": "Beatriz Marmo Scaglione",
      "date": "2022"
    },
    {
      "img": "/formerMembers/BrunaDiGiovanni.png",
      "name": "Bruna Di Giovanni",
      "date": ""
    },
    {
      "img": "/formerMembers/Bruno.jpg",
      "name": "Bruno Eduardo",
      "date": "2021"
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "Caio Dias",
      "date": ""
    },
    {
      "img": "/formerMembers/Claudia.jpg",
      "name": "Claudia Fiorentino Andrade",
      "date": "2021 a 2022"
    },
    {
      "img": "/formerMembers/claudionor.jpg",
      "name": "Claudionor Domingues",
      "date": "2023"
    },
    {
      "img": "/formerMembers/DanielDLima.png",
      "name": "Daniel D. Lima",
      "date": ""
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "Douglas",
      "date": "2023"
    },
    {
      "img": "/formerMembers/EduardoKobaiashi.png",
      "name": "Eduardo Kobaiashi",
      "date": ""
    },
    {
      "img": "/formerMembers/ErickLopes.png",
      "name": "Erick Fernando Doria Lopes",
      "date": "2017 a 2019"
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "Gabriel Lemos",
      "date": ""
    },
    {
      "img": "/formerMembers/GabrielMeloFranciscoCorreia.png",
      "name": "Gabriel Melo Francisco Correia",
      "date": "2018"
    },
    {
      "img": "/formerMembers/GabrielSouza.jpg",
      "name": "Gabriel Souza",
      "date": "2019 a 2020"
    },
    {
      "img": "/formerMembers/GiovanniVicario.png",
      "name": "Giovanni Vicário",
      "date": "2019"
    },
    {
      "img": "/formerMembers/GuilhermeLopesdeOliveira.jpg",
      "name": "Guilherme Lopes de Oliveira",
      "date": "2019 a 2020"
    },
    {
      "img": "/formerMembers/GuilhermeReis.png",
      "name": "Guilherme Reis",
      "date": ""
    },
    {
      "img": "/formerMembers/GustavoKozonoe.jpeg",
      "name": "Gustavo Kozonoe",
      "date": ""
    },
    {
      "img": "/formerMembers/IagoSalomon.jpg",
      "name": "Iago Salomon",
      "date": "2018"
    },
    {
      "img": "/formerMembers/irvin.jpg",
      "name": "Irvin Ken Xavier Tavares",
      "date": "2022"
    },
    {
      "img": "/formerMembers/IsabelaRuizRoquedaSilva.png",
      "name": "Isabela Ruiz Roque da Silva",
      "date": "2019 a 2021"
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "João Pedro Bianchini Ramos",
      "date": "2023"
    },
    {
      "img": "/formerMembers/zezinho.jpeg",
      "name": "José Eduardo Bernardino Jorge",
      "date": "2022 a 2023"
    },
    {
      "img": "/formerMembers/Kleber.png",
      "name": "Kleber Yoshida",
      "date": ""
    },
    {
      "img": "/formerMembers/Leandro.png",
      "name": "Leandro Alexandre",
      "date": "2018"
    },
    {
      "img": "/formerMembers/LeandroReis.jpeg",
      "name": "Leandro Reis",
      "date": "2019 a 2020"
    },
    {
      "img": "https://media.licdn.com/dms/image/C4E03AQECTaP8sjBTyw/profile-displayphoto-shrink_800_800/0/1571866741900?e=1709769600&v=beta&t=aaFOSMQNxLdq57E0jSIRBOPL6g5u_UpQ0Nf-Y0y9LNk",
      "name": "Leandro Soares Dantas",
      "date": ""
    },
    {
      "img": "/formerMembers/Leticia.jpg",
      "name": "Letícia Colombo",
      "date": "2021 a 2022"
    },
    {
      "img": "/formerMembers/lidia.png",
      "name": "Lídia Carolina",
      "date": "2023"
    },
    {
      "img": "/formerMembers/Lucas.jpg",
      "name": "Lucas",
      "date": ""
    },
    {
      "img": "https://media.licdn.com/dms/image/C4E03AQG6Br7OvrJz1Q/profile-displayphoto-shrink_800_800/0/1598549518408?e=1709769600&v=beta&t=re8A62UzhQpHWyrsd_2POVcCKh4VSW_sgTM8rfFwhzw",
      "name": "Lucas Ellery Viana",
      "date": "2022 a 2023"
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "Lucas Hort",
      "date": ""
    },
    {
      "img": "/formerMembers/semFoto.png",
      "name": "Lucas Tonin",
      "date": "2023"
    },
    {
      "img": "/formerMembers/MarceloTakayama.png",
      "name": "Marcelo Takayama",
      "date": "2019 a 2020"
    },
    {
      "img": "/formerMembers/marcosRaia.jpg",
      "name": "Marcos Librelon Raia",
      "date": "2023"
    },
    {
      "img": "https://media.licdn.com/dms/image/D4D03AQFs_o4RCRzm8w/profile-displayphoto-shrink_800_800/0/1694014951330?e=1709769600&v=beta&t=wizi1j9G4tGc2G76W2dFdU7qHHGdWm8D33_hVwI7LMY",
      "name": "Mateus Gois",
      "date": "2017 a 2019"
    },
    {
      "img": "/formerMembers/MatheusPortilho.jpeg",
      "name": "Matheus de Oliveira Portilho",
      "date": "2022"
    },
    {
      "img": "/formerMembers/Silvestre.jpeg",
      "name": "Matheus Oliveira Silvestre",
      "date": "2021 a 2022"
    },
    {
      "img": "/formerMembers/Mikael.jpg",
      "name": "Mikael Muniz",
      "date": "2020 a 2023"
    },
    {
      "img": "/formerMembers/RafaelLua.jpg",
      "name": "Rafael Lua",
      "date": "2019 a 2020"
    },
    {
      "img": "/formerMembers/RafaelVieira.jpeg",
      "name": "Rafael Vieira Brancaccio",
      "date": ""
    },
    {
      "img": "/formerMembers/Renato Alves Ribeiro.jpeg",
      "name": "Renato Alves Ribeiro",
      "date": ""
    },
    {
      "img": "/formerMembers/RobertoTsunki.jpg",
      "name": "Roberto Tsunki",
      "date": "2020"
    },
    {
      "img": "/formerMembers/Sabrinna.jpg",
      "name": "Sabrinna Delgado",
      "date": "2019 a 2022"
    },
    {
      "img": "/formerMembers/thiagoAguirre.jpg",
      "name": "Thiago Oliveira Aguirre",
      "date": "2023"
    },
    {
      "img": "https://media.licdn.com/dms/image/D4D03AQETsrbFiznSuw/profile-displayphoto-shrink_800_800/0/1689271693313?e=1709769600&v=beta&t=_BdQuoDLuxS_LmBUWwhHTOqkfCJPZRO4Ca41JYDAJlA",
      "name": "Vitor Ravacci",
      "date": ""
    },
    {
      "img": "/formerMembers/WolfgangWalder.png",
      "name": "Wolfgang Walder",
      "date": "2018"
    }
  ],
  "related": [
    {
      "img": "/cloud.jpeg",
      "title": "Estação Meteorológica",
      "description": "Aplicação que se comunica a uma estação meteorológica e seus sensores, coletando e manipulando dados climáticos em tempo real."
    },
    {
      "img": "/minimalist_setup.jpeg",
      "title": "Site Mackleaps",
      "description": "Tem como escopo divulgar pesquisas e projetos relacionados à tecnologia e recrutar potenciais membros e parceiros."
    },
    {
      "img": "/camera.jpeg",
      "title": "Contador de Gente",
      "description": "Tem como objetivo a contagem do número de pessoas que entram nos prédios do campus universitário Higienópolis da Mackenzie."
    }
  ],

  "sistemas": [
    {
      "title": "Oriente",
      "description": "O Oriente é um sistema de submissão/acompanhamento de TCC em que os professores são capazes de acompanhar o TCC de seus alunos e avaliar projetos de outros orientadores quando sua avaliação for solicitada. Em uma visão geral, o oriente permite uma melhor visualização para professores e alunos sobre seus TCC´s.",
      "link": "https://mackleaps.mackenzie.br/oriente"
    },
    {
      "title": "GitBook",
      "description": "Os alunos do Programa de Residência de Software - MackLeaps são motivados a desenvolver conteúdos durante a execução dos projetos, na modalidade PBL. Os conteúdos disponibilizados são utilizados pelos novos residentes para ajudar no enfrentamento dos desafios ao longo do programa.",
      "link": "https://lab-mackleaps.gitbook.io/residencia-de-software-macklaeps-upm-fci/"
    },
    {
      "title": "Redmine",
      "description": "É um sistema gerenciador de projetos baseados na web e ferramenta de gerenciamento de bugs. Ele contém calendário e gráficos de Gantt para ajudar na representação visual dos projetos e seus deadlines.",
      "link": "https://mackleaps.mackenzie.br/redmine"
    },
    {
      "title": "Carrossel",
      "description": "Aplicação responsável por controlar as imagens presentes na televisão que fica na entrada do prédio 31 (FCI) do campus Higienópolis da Universidade Presbiteriana Mackenzie. Tem como objetivo, a divulgação de projetos e eventos que ocorrem na universidade.",
      "link": "https://mackleaps.mackenzie.br/carrossel"
    },
    {
      "title": "Contador de gente",
      "description": "Tem como objetivo a contagem do número de pessoas que entram nos prédios do campus universitário Higienópolis da Mackenzie. O sistema coletará e armazenará dados em um servidor local (ou em nuvem) e disponibilizará um dashboard por meio de uma aplicação web.",
      "link": "/"
    },
    {
      "title": "Estação Meteorológica",
      "description": "Aplicação que se comunica a uma estação meteorológica e seus sensores, coletando e manipulando dados climáticos em tempo real. O sistema armazena os dados coletados em um banco de dados, oferecendo funções como filtrar e descargar os dados brutos para fim de análise.",
      "link": "/"
    }
  ]
}
